<!-- terraform-plan-comment -->
# Terraform Plan Results

**4 change(s):** 4 to create, 0 to update, 0 to replace, 0 to destroy

**➕ Resources will be added**

## Resources to create:
- `databricks_catalog.segment_storage`
- `databricks_grants.catalog_segment_storage`
- `databricks_grants.external_location_storage`
- `databricks_secret_acl.dbt_cloud_staging_secrets_dev`

<details>
<summary>Show diff</summary>

```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # databricks_catalog.segment_storage will be created
  + resource "databricks_catalog" "segment_storage" {
      + catalog_type                   = (known after apply)
      + comment                        = "Dedicated catalog for Segment storage destination"
      + created_at                     = (known after apply)
      + created_by                     = (known after apply)
      + enable_predictive_optimization = (known after apply)
      + force_destroy                  = false
      + full_name                      = (known after apply)
      + id                             = (known after apply)
      + isolation_mode                 = "OPEN"
      + metastore_id                   = (known after apply)
      + name                           = "segment_storage"
      + owner                          = (known after apply)
      + properties                     = {
          + "managed_by" = "terraform"
        }
      + securable_type                 = (known after apply)
      + storage_location               = (known after apply)
      + storage_root                   = "s3://goodparty-warehouse-databricks/segment_storage"
      + updated_at                     = (known after apply)
      + updated_by                     = (known after apply)

      + effective_predictive_optimization_flag (known after apply)

      + provisioning_info (known after apply)
    }

  # databricks_grants.catalog_segment_storage will be created
  + resource "databricks_grants" "catalog_segment_storage" {
      + catalog = "segment_storage"
      + id      = (known after apply)

      + grant {
          + principal  = "0d945bd8-d62f-4e9f-80bf-e3c40b2ea1ec"
          + privileges = [
              + "CREATE_SCHEMA",
              + "CREATE_TABLE",
              + "SELECT",
              + "USE_CATALOG",
              + "USE_SCHEMA",
            ]
        }
    }

  # databricks_grants.external_location_storage will be created
  + resource "databricks_grants" "external_location_storage" {
      + external_location = "db_s3_external_databricks-s3-ingest-dbca4"
      + id                = (known after apply)

      + grant {
          + principal  = "a04e9e24-aac3-4308-9a65-d88fa34e444f"
          + privileges = [
              + "CREATE_MANAGED_STORAGE",
            ]
        }
    }

  # databricks_secret_acl.dbt_cloud_staging_secrets_dev will be created
  + resource "databricks_secret_acl" "dbt_cloud_staging_secrets_dev" {
      + id         = (known after apply)
      + permission = "READ"
      + principal  = "55a382da-4185-4d9c-bf59-c3283c6ef319"
      + scope      = "dbt-secrets-dev"
    }

Plan: 4 to add, 0 to change, 0 to destroy.
```

</details>

---

<details>
<summary>What do these mean?</summary>

- **Create**: New resources will be added
- **Update**: Existing resources will be modified in-place
- **Replace**: Resources will be destroyed and recreated (data loss possible)
- **Destroy**: Resources will be permanently deleted

</details>

---

**To apply these changes:**

1. **Merge** this PR to `main`
2. **Review** the plan in the workflow run triggered by the merge
3. **Deploy** via Actions → Deploy → Run workflow → uncheck "Dry run"

Or via CLI after merge: `gh workflow run deploy.yaml -f dry_run=false`
